# Lede Algorithms -- Assignment 1

In this assignment you will use a little algebra to figure out how to take the average of averages.

In [2]:
import pandas as pd

First, read in the titanic.csv data set.

In [3]:
df = pd.read_csv('week-1/titanic.csv')
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>pclass</th>
      <th>survived</th>
      <th>name</th>
      <th>age</th>
      <th>embarked</th>
      <th>home.dest</th>
      <th>room</th>
      <th>ticket</th>
      <th>boat</th>
      <th>gender</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>1st</td>
      <td>1</td>
      <td>Allen, Miss Elisabeth Walton</td>
      <td>29.0000</td>
      <td>Southampton</td>
      <td>St Louis, MO</td>
      <td>B-5</td>
      <td>24160 L221</td>
      <td>2</td>
      <td>female</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1st</td>
      <td>0</td>
      <td>Allison, Miss Helen Loraine</td>
      <td>2.0000</td>
      <td>Southampton</td>
      <td>Montreal, PQ / Chesterville, ON</td>
      <td>C26</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>female</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1st</td>
      <td>0</td>
      <td>Allison, Mr Hudson Joshua Creighton</td>
      <td>30.0000</td>
      <td>Southampton</td>
      <td>Montreal, PQ / Chesterville, ON</td>
      <td>C26</td>
      <td>NaN</td>
      <td>-135</td>
      <td>male</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1st</td>
      <td>0</td>
      <td>Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)</td>
      <td>25.0000</td>
      <td>Southampton</td>
      <td>Montreal, PQ / Chesterville, ON</td>
      <td>C26</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>female</td>
    </tr>
    <tr>
      <th>4</th>
      <td>1st</td>
      <td>1</td>
      <td>Allison, Master Hudson Trevor</td>
      <td>0.9167</td>
      <td>Southampton</td>
      <td>Montreal, PQ / Chesterville, ON</td>
      <td>C22</td>
      <td>NaN</td>
      <td>11</td>
      <td>male</td>
    </tr>
  </tbody>
</table>
</div>

Compute the average survival rate (mean of the `survived` column)

In [3]:
df['survived'].mean()

0.341964965727342

Now compute the average survival rates of the male and female 1st, 2nd, and 3rd class passengers (six groups in total)

In [5]:
df.groupby(by=['pclass', 'gender'])['survived'].mean()

pclass  gender
1st     female    0.937063
        male      0.329609
2nd     female    0.878505
        male      0.144509
3rd     female    0.370892
        male      0.116466
Name: survived, dtype: float64

Compute the average of these six averages. Is it the same as the the overall average?

In [6]:
df.groupby(by=['pclass', 'gender'])['survived'].mean().mean()

0.4628405168768348

How would you compute the overall average from the average of averages? Start with the formulas

$$mean = \frac{\sum_{i=1}^N x_i}{N}$$

for the overall mean, where $x_i$ is data value $i$ and $N$ is the total number of values, and

$$mean_k = \frac{\sum_{i=1}^{N_k} xk_i}{N_k}$$

is the mean of group $k$, where $xk_i$ is value $i$ of group $k$ and $N_k$ is the number of values in group $k$, and

$$N = \sum_{i=1}^M N_k$$

relates the total number of values $N$ to the number of values in each of the $M$ groups.

Your task is to derive a formula that computes $mean$ using only $mean_k$, the $N_k$, and $N$. Note: this question is not asking you to write code! Rather, you must answer two questions:

- What is the correct formula?
- How can we derive this formula starting from the formulas above?

$$
mean = \frac{\sum_{i=1}^N x_i}{N} = \frac{\sum_{j=i}^M \sum_{i=1}^{N_k} xk_i}{N} = \frac{\sum_{j=1}^M \frac{\sum_{i=1}^{N_k} xk_i}{N_k} N_k}{N} = \frac{\sum_{j=1}^{M} mean_k N_k}{N}
$$

1. $mean$ as defined above
2. This is equivalent because of how addition works: commutativity and associativity
3. Divide and multiply by $N_k$
4. $\frac{\sum_{i=1}^{N_k} xk_i}{N_k}$ is the same as $mean_k$, as defined above, and can be replaced

Now use this formula to calculate the overall mean. Does it match?

In [8]:
(df.groupby(by=['pclass', 'gender'])['survived'].mean() * 
df.groupby(by=['pclass', 'gender'])['survived'].count()).sum() / len(df)

0.341964965727342